#Область ПрограммныйИнтерфейс

// Возвращает ссылку на документ РеализацияТоваровИУслуг созданный на основании документОснованиеСсылка.\
// Документ РеализацияТоваровИУслуг должен иметь статус: Проведен
//
// Параметры:
//	документОснованиеСсылка - ДокументСсылка.ЗаписьКлиента
//
// Возвращаемое значение:
//	- ДокументСсылка.РеализацияТоваровИУслуг, Неопределено
//
Функция ПолучитьДокументРеализацииНаОсновании(Знач документОснованиеСсылка) Экспорт
	Если НЕ ЗначениеЗаполнено(документОснованиеСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;

	запросДокументаРеализации = Новый Запрос;
	запросДокументаРеализации.УстановитьПараметр("Ссылка", документОснованиеСсылка);

	запросДокументаРеализации.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровИУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.ДокументОснование = &Ссылка
	|		И РеализацияТоваровИУслуг.Проведен
	|";

	результатЗапроса = запросДокументаРеализации.Выполнить();
	Если результатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	выборка = результатЗапроса.Выбрать();
	выборка.Следующий();

	Возврат выборка.Ссылка;

КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
