//функция выполняет приведение строки к числу
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено
//
// Возвращаемое значение:
//  Число
//
Функция ПривестиСтрокуКЧислу(Знач ЧислоСтрокой, Знач ВозвращатьНеопределено = Ложь) Экспорт
    
    ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
    ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
    
    Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
        
        Стр = Строка(ЧислоСтрокой);
        Если Стр = "" Тогда
            Возврат Неопределено;
        КонецЕсли;
        
        Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
        Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
            Возврат Неопределено;
        КонецЕсли;
    КонецЕсли;
    
    Возврат ЗначениеЧисла;    
    
КонецФункции