#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(_)
	рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(_)
	рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры
#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТовары

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура рассчитатьСуммуПоСтрокеТовары()
	текущСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	текущСтрокаТовары.Сумма = текущСтрокаТовары.Цена * текущСтрокаТовары.Количество;
КонецПроцедуры
#КонецОбласти // СлужебныеПроцедурыИФункции
