&НаКлиенте
Процедура РаботаСКоллекциямиЗначений(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#Область ВводЗначения
&НаКлиенте
Процедура ВводПоложительногоЧисла(Команда)
	ПоказатьВводЧислаПользователя("Введите положительное число!");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводЧислаПользователя(ТекстПодсказки)
	ОбработкаВводаПользователя = Новый ОписаниеОповещения("ПоказатьВводЧислаЗавершение", ЭтотОбъект);
	ПоказатьВводЧисла(ОбработкаВводаПользователя, 0, ТекстПодсказки);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВводЧислаЗавершение(ВведенноеЧисло, Параметры) Экспорт
	Если ВведенноеЧисло <> Неопределено И ВведенноеЧисло > 0 Тогда
		Сообщить("Вы молодец!");
	ИначеЕсли ВведенноеЧисло = 0 Тогда
		ПоказатьВводЧислаПользователя("Вы ввели 0, повторите попытку!");
	Иначе
		ПоказатьВводЧислаПользователя("Вы ввели отрицательное число, повторите попытку!");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
