#Область ОписаниеПеременных

Перем _КэшТипыКонтрагентов; // Хранит кэш значения Перечисления.ТипыКонтрагентов

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
	установитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(_)
	установитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура установитьВидимостьЭлементовФормы()
	// Реализация метода выполнена с учетом возможности изменений
	// конфигурации / добавления значений в Перечисления.ТипыКонтрагентов
	
	этоКлиент_ = этоКлиент();
	
	Элементы.ДатаРождения.Видимость = этоКлиент_;
	Элементы.Пол.Видимость = этоКлиент_;
	Элементы.Источник.Видимость = этоКлиент_;
	
	этоПоставщик_ = ?(этоКлиент_, Ложь, этоПоставщик());
	Элементы.ОсновнойДоговор.Видимость = этоПоставщик_;
	
	Элементы.Наименование.Заголовок = ?(этоКлиент_, "Ф.И.О. клиента", "Наименование");
КонецПроцедуры

&НаСервере
Функция этоКлиент()
	Возврат Объект.ТипКонтрагента = получитьТипыКонтрагентов().Клиент;
КонецФункции

&НаСервере
Функция этоПоставщик()
	Возврат Объект.ТипКонтрагента = получитьТипыКонтрагентов().Поставщик;
КонецФункции

&НаСервере
Функция получитьТипыКонтрагентов()
	_КэшТипыКонтрагентов = ?(_КэшТипыКонтрагентов <> Неопределено,
			_КэшТипыКонтрагентов, Перечисления.ТипыКонтрагентов);
	Возврат _КэшТипыКонтрагентов;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции