#Область ПрограммныйИнтерфейс

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие - Булево - если не равно Истина, то вызывается исключение.
//   Сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//   КонтекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//
Процедура Утверждение(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "") Экспорт
	Если Условие <> Истина Тогда
		Если ПустаяСтрока(Сообщение) Тогда
			текстИсключения = НСтр("ru = 'Недопустимая операция'");
		Иначе
			текстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			текстИсключения = СтрШаблон(
				НСтр("ru = '%1 в %2'"), текстИсключения, КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение текстИсключения;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс