
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		ВыполнитьДвижениеТоварыНаСкладах(ТекСтрокаТовары);
		ВыполнитьДвижениеЗаказыКлиентов(ТекСтрокаТовары);
		ВыполнитьДвижениеПродажи(ТекСтрокаТовары);
	КонецЦикла;

	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		ВыполнитьДвижениеПродажи(ТекСтрокаУслуги);
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаписьКлиента") Тогда
		// Заполнение шапки
		АвторДокумента = ДанныеЗаполнения.АвторДокумента;
		ДатаОказанияУслуги = ДанныеЗаполнения.ДатаЗаписи;
		Клиент = ДанныеЗаполнения.Клиент;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаУслуги.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ВыполнитьДвижениеТоварыНаСкладах(ТекСтрокаТовары)
	Движение = Движения.ТоварыНаСкладах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	Движение.Склад = ТекСтрокаТовары.Склад;
	Движение.Количество = ТекСтрокаТовары.Количество;
КонецПроцедуры

Процедура ВыполнитьДвижениеЗаказыКлиентов(ТекСтрокаУслуги)
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ДатаЗаписи = ДатаОказанияУслуги;
	Движение.Количество = ТекСтрокаУслуги.Количество;
	Движение.Сумма = ТекСтрокаУслуги.Сумма;
КонецПроцедуры

Процедура ВыполнитьДвижениеПродажи(ТекСтрока)
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.Номенклатура = ТекСтрока.Номенклатура;
	Движение.Сотрудник = Сотрудник;
	Движение.Количество = ТекСтрока.Количество;
	Движение.Сумма = ТекСтрока.Сумма;
КонецПроцедуры
