#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(_, __)
    выполнитьВсеДвижения();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура выполнитьВсеДвижения()
    Движения.Начисления.Записывать = Истина;
    Движения.Хозрасчетный.Записывать = Истина;
    Движения.УчетЗатрат.Записывать = Истина;

    выполнитьДвиженияПоВсемНачислениям();
    Движения.Начисления.Записать();
    Движения.Начисления.РассчитатьСуммуНачисления();

    данныеНачислений = РегистрыРасчета.Начисления.ПолучитьДанныеНачисленийДокумента(ЭтотОбъект.Ссылка, Истина);

    Для Каждого статьяЗатратНачисления Из данныеНачислений.НачисленияПоСтатьямЗатрат Цикл
        выполнитьДвижениеУчетЗатратОборот(статьяЗатратНачисления.статьяЗатрат, статьяЗатратНачисления.Сумма);
    КонецЦикла;

    Для Каждого структураНачисления Из данныеНачислений.Начисления Цикл
        выполнитьДвижениеБУХозрасчетный(структураНачисления);
    КонецЦикла;
КонецПроцедуры

Процедура выполнитьДвиженияПоВсемНачислениям()
    Для Каждого строкаНачисления Из ЭтотОбъект.Начисления Цикл
        структураНачисления = РегистрыРасчета.Начисления.СоздатьПустуюСтруктуруНачисления();
        ЗаполнитьЗначенияСвойств(структураНачисления, строкаНачисления);

        РегистрыРасчета.Начисления.ЗаполнитьДвижениеНачисления(
            Движения.Начисления.Добавить(), ЭтотОбъект.ПериодНачисления, структураНачисления);
    КонецЦикла;
КонецПроцедуры

Процедура выполнитьДвижениеБУХозрасчетный(Знач структураНачисления)
    движение = Движения.Хозрасчетный.Добавить();
    движение.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;
    движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
    движение.Период = ЭтотОбъект.Дата;
    движение.Сумма = структураНачисления.Сумма;
    движение.Содержание = "Отражено начисление заработной платы сотрудникам";
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(движение.СчетДт,
        движение.СубконтоДт, структураНачисления.СтатьяЗатрат);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(движение.СчетКт,
        движение.СубконтоКт, структураНачисления.Сотрудник);
КонецПроцедуры

Процедура выполнитьДвижениеУчетЗатратОборот(Знач статьяЗатрат, Знач сумма)
    движение = Движения.УчетЗатрат.Добавить();
    движение.Период = ЭтотОбъект.Дата;
    движение.СтатьяЗатрат = статьяЗатрат;
    движение.Сумма = сумма;
КонецПроцедуры
#КонецОбласти // Движения

#КонецОбласти // СлужебныеПроцедурыИФункции
