Функция ПолучитьТаблицуЗначенийИзТабличногоДокумента(Знач табДокПрайсЛиста) Экспорт

    таблицаПрайсЛиста = Новый ТаблицаЗначений;

    таблицаПрайсЛиста.Колонки.Добавить("АртикулНоменклатуры", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(13)));
    таблицаПрайсЛиста.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));

    количествоСтрок = табДокПрайсЛиста.ВысотаТаблицы;
    Если количествоСтрок = 0 Тогда
        Возврат таблицаПрайсЛиста;
    КонецЕсли;

    содержитАртикул = РаботаСоСтрокамиВызовСервера.ПодобнаПоРегулярномуВыражению(
            табДокПрайсЛиста.ПолучитьОбласть("R1C1").ТекущаяОбласть.Текст, "\.*[Аа]ртикул\.*");
    содержитЦену = РаботаСоСтрокамиВызовСервера.ПодобнаПоРегулярномуВыражению(
            табДокПрайсЛиста.ПолучитьОбласть("R1C2").ТекущаяОбласть.Текст, "\.*[Цц]ена\.*");
    содержитШапку = содержитАртикул ИЛИ содержитЦену;

    Для сч = ?(содержитШапку, 2, 1) По количествоСтрок Цикл
        стрНомерСтроки = Формат(сч, "ЧГ=0");
        новаяСтрокаПрайса = таблицаПрайсЛиста.Добавить();

        артикулНоменклатуры = Строка(
                табДокПрайсЛиста.ПолучитьОбласть(СтрШаблон("R%1C1", стрНомерСтроки)).ТекущаяОбласть.Текст);
        ценаНоменклатуры = ПреобразованиеТиповКлиентСервер.ПривестиСтрокуКЧислу(
                табДокПрайсЛиста.ПолучитьОбласть(СтрШаблон("R%1C2", стрНомерСтроки)).ТекущаяОбласть.Текст, Истина);

        Если ценаНоменклатуры = Неопределено Тогда
            ВызватьИсключение СтрШаблон("Ошибка чтения значения цены в строке %1", стрНомерСтроки);
        КонецЕсли;

        новаяСтрокаПрайса.АртикулНоменклатуры = артикулНоменклатуры;
        новаяСтрокаПрайса.Цена = ценаНоменклатуры;
    КонецЦикла;

    Возврат таблицаПрайсЛиста;
КонецФункции