#Область ПрограммныйИнтерфейс

// Параметры:
//  движение - Движение
//  периодНачисления - Дата
//  структураНачисления - Структура, ФиксированнаяСтруктура - Пустая структура начисления
//      * ВидРасчета - ПланВидовРасчетаСсылка.Начисления
//      * ПериодДействияНачало - Дата
//      * ПериодДействияКонец - Дата
//      * БазовыйПериодНачало - Дата
//      * БазовыйПериодКонец - Дата
//      * Сотрудник - СправочникСсылка.Сотрудник
//      * ПоказательРасчета - Число
//      * График - СправочникСсылка.График
//      * Сумма - Число
// Возвращаемое значение:
//  - Движение
Функция ЗаполнитьДвижениеНачисления(Знач движение, Знач периодНачисления, Знач структураНачисления) Экспорт
	движение.Сторно = Ложь;
    движение.ПериодРегистрации = периодНачисления;

    движение.ВидРасчета = структураНачисления.ВидРасчета;
	движение.ПериодДействияНачало = структураНачисления.ДатаНачала;
	движение.ПериодДействияКонец = структураНачисления.ДатаОкончания;
	движение.БазовыйПериодНачало = структураНачисления.ДатаНачала;
	движение.БазовыйПериодКонец = структураНачисления.ДатаОкончания;
	движение.Сотрудник = структураНачисления.Сотрудник;
	движение.ПоказательРасчета = структураНачисления.ПоказательРасчета;
	движение.График = структураНачисления.ГрафикРаботы;
    движение.Сумма = структураНачисления.Сумма;

	Возврат движение;
КонецФункции

// Возвращаемое значение:
//  - Структура - Пустая структура начисления
//      * ВидРасчета - Неопределено
//      * ПериодДействияНачало - Неопределено
//      * ПериодДействияКонец - Неопределено
//      * БазовыйПериодНачало - Неопределено
//      * БазовыйПериодКонец - Неопределено
//      * Сотрудник - Неопределено
//      * ПоказательРасчета - Неопределено
//      * График - Неопределено
//      * Сумма - Неопределено
Функция СоздатьПустуюСтруктуруНачисления() Экспорт
    структураНачисления = Новый Структура;

    // Стандартные реквизиты
    структураНачисления.Вставить("ВидРасчета");
	структураНачисления.Вставить("ПериодДействияНачало");
	структураНачисления.Вставить("ПериодДействияКонец");
	структураНачисления.Вставить("БазовыйПериодНачало");
	структураНачисления.Вставить("БазовыйПериодКонец");

    // Реквизиты
    структураНачисления.Вставить("ПоказательРасчета");
	структураНачисления.Вставить("График");

    // Измерения
	структураНачисления.Вставить("Сотрудник");

    // Ресурсы
    структураНачисления.Вставить("Сумма");

    Возврат структураНачисления;
КонецФункции

// Возвращаемое значение:
//  - Массив
Функция ПолучитьКлючиСтруктурыНачисления() Экспорт
    Возврат РаботаСКоллекциямиКлиентСервер.ПолучитьКлючиСтруктуры(СоздатьПустуюСтруктуруНачисления());
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
