#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(данныеЗаполнения, __, ___)
	заполнитьДокументНаОсновании(данныеЗаполнения);
	РаботаСДокументами.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    очиститьДвижения();

    Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
        Движения.ДенежныеСредства.Записывать = Истина;
        выполнитьДвижениеДенежныеСредстваПриход();

    ИначеЕсли ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда
        Движения.БезналичнаяОплата.Записывать = Истина;
        выполнитьДвижениеБезналичнаяОплатаОборот();

    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура очиститьДвижения()
    Движения.ДенежныеСредства.Записывать = Истина;
    Движения.БезналичнаяОплата.Записывать = Истина;

    Движения.Записать();
КонецПроцедуры

Процедура выполнитьДвижениеДенежныеСредстваПриход()
	движение = Движения.ДенежныеСредства.Добавить();
	движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	движение.Период = Дата;
	движение.БанковскийСчетКасса = Касса;
	движение.ТипДенежныхСредств = ТипДенежныхСредств;
	движение.Сумма = СуммаДокумента;
КонецПроцедуры

Процедура выполнитьДвижениеБезналичнаяОплатаОборот()
	движение = Движения.БезналичнаяОплата.Добавить();
	движение.Период = Дата;
	движение.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
	движение.Сумма = СуммаДокумента;
КонецПроцедуры
#КонецОбласти // Движения

// Параметры:
//  данныеЗаполнения - ДокументСсылка.РеализацияТоваровИУслуг
//
// Возвращаемое значение:
//  - Булево - Истина если значения заполнены иначе - Ложь
Функция заполнитьДокументНаОсновании(Знач данныеЗаполнения)
	Если данныеЗаполнения = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	типДокументаОСнования = ТипЗнч(данныеЗаполнения);
	Если типДокументаОСнования = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		ДокументОснование = данныеЗаполнения.Ссылка;
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
		Плательщик = данныеЗаполнения.Клиент;
		СуммаДокумента = данныеЗаполнения.СуммаДокумента;

		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
