
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Движение = Движения.Начисления.Добавить();
	Движение.Сторно = Ложь;
	Движение.ПериодДействияНачало = ПериодНачисления;
	Движение.ПериодДействияКонец = ПериодНачисления;
	Движение.ПериодРегистрации = ПериодНачисления;
	Движение.БазовыйПериодНачало = ПериодНачисления;
	Движение.БазовыйПериодКонец = ПериодНачисления;
	Движение.Сотрудник = Неопределено;
	Движение.Сумма = Неопределено;
	Движение.ПоказательРасчета = Неопределено;
	Движение.График = Неопределено;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
