#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//	- Структура
Функция ПолучитьТипыНоменклатуры() Экспорт
    результат = РаботаСМетаданными.ПолучитьЗначенияПеречисления(Тип("ПеречислениеСсылка.ТипыНоменклатуры"));
    Если результат = Неопределено Тогда
        ВызватьИсключение "Ошибка при получении значений перечисления ""ТипыНоменклатуры"".";
    КонецЕсли;

    ДиагностикаКлиентСервер.Утверждение(ТипЗнч(результат) = Тип("Структура") И ЗначениеЗаполнено(результат),
            "Структура значений перечисления ""ТипыНоменклатуры"" не соответствует ожиданию.
            |Структура значений должна иметь тип ""Структура"" и быть заполненной.",
            "Справочники.Номенклатура.МодульМенеджера.ПолучитьТипыНоменклатуры");

    Возврат результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
