#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//	- Структура
Функция ПолучитьВидыОперацийПоступленияНаРасчетныйСчет() Экспорт
	Возврат РаботаСМетаданными.ПолучитьЗначенияПеречисления(Тип("ПеречислениеСсылка.ВидыОперацийПоступленияНаРасчетныйСчет"));
КонецФункции

// Возвращаемое значение:
//	- СправочникСсылка.Кассы, Неопределено
Функция ПолучитьКассуПоУмолчанию() Экспорт
	Возврат Справочники.Кассы.ПолучитьОсновнуюКассу();
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
