#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(отказ, __)
    Движения.ДенежныеСредства.Записывать = Истина;
    движение = Движения.ДенежныеСредства.Добавить();
    движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    движение.Период = Дата;
    движение.ТипДенежныхСредств = ?(ВидОперации = Перечисления.ВидыОперацийПоступленияНаРасчетныйСчет.ВзносНаличными,
            Перечисления.ТипыДенежныхСредств.Наличные, Перечисления.ТипыДенежныхСредств.Безналичные);
    движение.БанковскийСчетКасса = РасчетныйСчет;
    движение.Сумма = СуммаДокумента;
КонецПроцедуры

Процедура ОбработкаЗаполнения(данныеЗаполнения, __)
    РаботаСДокументами.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
