#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры
#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТовары

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	рассчитатьСуммуПоСтрокеУслуги();
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	рассчитатьСуммуПоСтрокеУслуги();
КонецПроцедуры
#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУслуги

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура рассчитатьСуммуПоСтрокеУслуги()
	текущСтрокаУслуги = Элементы.Услуги.ТекущиеДанные;
	текущСтрокаУслуги.Сумма = текущСтрокаУслуги.Цена * текущСтрокаУслуги.Количество;
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммуПоСтрокеТовары()
	текущСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	текущСтрокаТовары.Сумма = текущСтрокаТовары.Цена * текущСтрокаТовары.Количество;
КонецПроцедуры
#КонецОбласти // СлужебныеПроцедурыИФункции
