
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЦеныНоменклатурыПоставщиков.Записывать = Истина;
	Движения.ТоварыНаСкладах.Записывать = Истина;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		ВыполнитьДвижениеЦеныНоменклатурыПоставщиков(ТекСтрокаТовары);
		ВыполнитьДвижениеТоварыНаСкладах(ТекСтрокаТовары);
	КонецЦикла;
КонецПроцедуры

Процедура ВыполнитьДвижениеЦеныНоменклатурыПоставщиков(ТекСтрокаТовары)
	Движение = Движения.ЦеныНоменклатурыПоставщиков.Добавить();
	Движение.Период = Дата;
	Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	Движение.Поставщик = Поставщик;
	Движение.Цена = ТекСтрокаТовары.Цена;
КонецПроцедуры

Процедура ВыполнитьДвижениеТоварыНаСкладах(ТекСтрокаТовары)
	Движение = Движения.ТоварыНаСкладах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	Движение.Склад = Склад;
	Движение.Количество = ТекСтрокаТовары.Количество;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	АвторДокумента = ПараметрыСеанса.ТекущийПользователь; 
КонецПроцедуры
