Процедура ОбработкаПроведения(отказ, режим)
	Движения.ЦеныНоменклатурыПоставщиков.Записывать = Истина;
	Движения.ТоварыНаСкладах.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		ВыполнитьДвижениеЦеныНоменклатурыПоставщиков(ТекСтрокаТовары);
		ВыполнитьДвижениеТоварыНаСкладах(ТекСтрокаТовары);
	КонецЦикла;
КонецПроцедуры

Процедура ВыполнитьДвижениеЦеныНоменклатурыПоставщиков(текСтрокаТовары)
	Движение = Движения.ЦеныНоменклатурыПоставщиков.Добавить();
	Движение.Период = Дата;
	Движение.Номенклатура = текСтрокаТовары.Номенклатура;
	Движение.Поставщик = Поставщик;
	Движение.Цена = текСтрокаТовары.Цена;
КонецПроцедуры

Процедура ВыполнитьДвижениеТоварыНаСкладах(текСтрокаТовары)
	Движение = Движения.ТоварыНаСкладах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = текСтрокаТовары.Номенклатура;
	Движение.Склад = Склад;
	Движение.Количество = текСтрокаТовары.Количество;
КонецПроцедуры

Процедура ПередЗаписью(отказ, режимЗаписи, режимПроведения)
	Если ОбменДанными.Загрузка ИЛИ отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры