#Область ПрограммныйИнтерфейс

// Параметры:
//	типПеречисления - Тип - Тип перечисления
//
// Возвращаемое значение:
//	Структура - Структура вида: { ИмяПеречисления, ЗначениеПеречисления }
//			  - Неопределено - Если указан неверный тип перечисления
Функция ПолучитьЗначенияПеречисления(Знач типПеречисления) Экспорт
    Если типПеречисления = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    метаданныеПеречисления = метаданныеПеречисления.НайтиПоТипу(типПеречисления);
    Если метаданныеПеречисления = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    результат = Новый Структура;
    Для Каждого значениеПеречисления Из метаданныеПеречисления.ЗначенияПеречисления Цикл
        имя_ = значениеПеречисления.Имя;
        результат.Вставить(имя_, Перечисления.ТипыДенежныхСредств[имя_]);
    КонецЦикла;
    
    Возврат результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
