#Область ПрограммныйИнтерфейс

// Параметры:
//	типПеречисления - Тип - Тип перечисления
//
// Возвращаемое значение:
//	Структура - Структура вида: { ИмяПеречисления, ЗначениеПеречисления }
//			  - Неопределено - Если указан неверный тип перечисления
Функция ПолучитьЗначенияПеречисления(Знач типПеречисления) Экспорт
    Если типПеречисления = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    метаданныеПеречисления = Метаданные.НайтиПоТипу(типПеречисления);
    Если метаданныеПеречисления = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    результат = Новый Структура;
    Для Каждого значениеПеречисления Из метаданныеПеречисления.ЗначенияПеречисления Цикл
        имя = значениеПеречисления.Имя;
        значение = Перечисления[метаданныеПеречисления.Имя][имя];
        результат.Вставить(имя, значение);
    КонецЦикла;

    Возврат результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
