#Область ПрограммныйИнтерфейс

Процедура КопироватьТаблицу(Знач ТаблицаПриемник, Знач ТаблицаИсточник) Экспорт
    Если ТаблицаПриемник = ТаблицаИсточник Тогда
        ВызватьИсключение """ТаблицаПриемник"" и ""ТаблицаИсточник"" должны быть различными объектами";
    КонецЕсли;

    ТаблицаПриемник.Очистить();
    ТаблицаПриемник.Колонки.Очистить();

    ТаблицаПриемник.Вставить(Макс(ТаблицаПриемник.Количество() + ТаблицаИсточник.Количество() - 1, 0));

    Для Каждого столбец Из ТаблицаИсточник.Колонки Цикл
        ТаблицаПриемник.Колонки.Добавить(
            столбец.Имя, столбец.ТипЗначения, столбец.Заголовок, столбец.Ширина);
        ТаблицаПриемник.ЗагрузитьКолонку(ТаблицаИсточник.ВыгрузитьКолонку(столбец.Имя), столбец.Имя);
    КонецЦикла;
КонецПроцедуры

Процедура ВставитьДанныеИзТаблицы(Знач ТаблицаПриемник, Знач ТаблицаИсточник) Экспорт
    Если ТаблицаПриемник = ТаблицаИсточник Тогда
        ВызватьИсключение """ТаблицаПриемник"" и ""ТаблицаИсточник"" должны быть различными объектами";
    КонецЕсли;

    Если ТаблицаИсточник.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    Для Каждого строкаИсточник Из ТаблицаИсточник Цикл
        строкаПриемник = ТаблицаПриемник.Добавить();
        Для Каждого столбец Из ТаблицаИсточник.Колонки Цикл
            строкаПриемник[столбец.Имя] = строкаИсточник[столбец.Имя];
        КонецЦикла;
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
