#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - ПланВидовХарактеристик.ВидыСубконто
Функция ПолучитьВидСубконтоПоСчету(Знач счет) Экспорт
    видыСубконто = счет.ВидыСубконто;

    Если видыСубконто.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;

    Возврат видыСубконто[0].ВидСубконто;
КонецФункции

// Возвращаемое значение:
//  - Булево
Функция ЗаполнитьСубконтоПоСчету(Знач счет, субконто, Знач значение) Экспорт
    видСубконто = ПолучитьВидСубконтоПоСчету(счет);
    Если видСубконто = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;

    субконто[видСубконто] = значение;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
