
Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ФормируемаяЗадачи Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадачи.Наименование  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " (Закупка товара: " + Номенклатура.Наименование +")";
	КонецЦикла;
КонецПроцедуры

Процедура ОплатаПоставщикуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	БизнесПроцесс = Задача.БизнесПроцесс;
	ДиагностикаКлиентСервер.Утверждение(ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ЗакупкаУПоставщика.ТочкиМаршрута.ОплатаПоставщику);
	
	Отказ =  НЕ ЗначениеЗаполнено(Задача.ОплатаПоставщику);
	Если Отказ = Истина Тогда
		Сообщить("Создайте документ ""Расход денежных средств"" и укажите его в задаче! ");
	Иначе
		БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
		БизнесПроцессОбъект.ОплатаПоставщику = Задача.ОплатаПоставщику;
		БизнесПроцессОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоставкаПодтвержденаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПоставкаПодтверждена;
КонецПроцедуры
