Функция ВалидацияПолейФИО(Строка)  
	результатПоиска = СтрНайтиПоРегулярномуВыражению(Строка, "[а-яА-ЯЁё\-]+");
	Возврат результатПоиска.НачальнаяПозиция > 0 И 
		СтрНайтиПоРегулярномуВыражению(Строка, "\-{2}").НачальнаяПозиция = 0;   
КонецФункции   
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = "Неверный формат ввода.";
	
	Если НЕ ВалидацияПолейФИО(Фамилия) Тогда   
		Сообщение.Поле = "Фамилия";     
		Сообщение.УстановитьДанные(ЭтотОбъект);
    	Сообщение.Сообщить();  
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти(Сообщение.Поле));
		Отказ = Истина;
		Возврат;
	КонецЕсли;       
	
	Если НЕ ВалидацияПолейФИО(Имя) Тогда   
		Сообщение.Поле = "Имя";
    	Сообщение.Сообщить();   
		Отказ = Истина;
		Возврат;
	КонецЕсли;       
	
	Если ЗначениеЗаполнено(Отчество) И НЕ ВалидацияПолейФИО(Отчество) Тогда   
		Сообщение.Поле = "Отчество";
    	Сообщение.Сообщить();   
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
КонецПроцедуры
