#Область ПрограммныйИнтерфейс

// Заполняет поле АвторДокумента
//
// Параметры:
//  объект - Структура - Документ или представление Документа
//
Процедура ЗаполнитьПолеАвторДокументаНаСервере(объект) Экспорт
	объект.АвторДокумента = ?(ЗначениеЗаполнено(объект.АвторДокумента),
			объект.АвторДокумента, ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

// Параметры:
//	плательщикСсылка
//		- СправочникСсылка.Контрагенты
//		- Произвольный
//
// Возвращаемое значение:
//	- Булево
Функция ЭтоКлиент(Знач плательщикСсылка) Экспорт // => Булево

	Если (плательщикСсылка = Неопределено) ИЛИ (ТипЗнч(плательщикСсылка) <> Тип("СправочникСсылка.Контрагенты")) Тогда
		Возврат Ложь;
	КонецЕсли;

	запросКонтрагента = Новый Запрос;
	запросКонтрагента.УстановитьПараметр("ПлательщикСсылка", плательщикСсылка);

	запросКонтрагента.Текст =
		"ВЫБРАТЬ
		|	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &ПлательщикСсылка
		|";

	результатЗапроса = запросКонтрагента.Выполнить();
	Если результатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	контрагент = результатЗапроса.Выбрать().Следующий();

	Если ЗначениеЗаполнено(контрагент.ТипКонтрагента)
		И контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
