&НаКлиенте
Процедура ФиоПриИзменении(Элемент)
	Объект.Фамилия = ОчиститьПоМаскеФИО(Объект.Фамилия);
	Объект.Имя = ОчиститьПоМаскеФИО(Объект.Имя);
	Объект.Отчество = ОчиститьПоМаскеФИО(Объект.Отчество);

	ПредЗначение = Объект.Наименование;
	Попытка
		Объект.Наименование = СоставитьФИО(Объект.Фамилия, Объект.Имя, Объект.Отчество);
	Исключение
		ПоказатьПредупреждение(,, ИнформацияОбОшибке());
		Элемент.ТекстРедактирования = "";
	КонецПопытки;
КонецПроцедуры

Функция ОчиститьПоМаскеФИО(Строка)
	РезПоиска = СтрНайтиПоРегулярномуВыражению(Строка, "[а-яА-ЯЁё\-]+");
	Если РезПоиска.НачальнаяПозиция = 0 Тогда
		Возврат "";
	КонецЕсли;

	Строка = РезПоиска.Значение;
	Строка = СтрЗаменитьПоРегулярномуВыражению(Строка, "-{2}", "-");

	РезПоиска = СтрНайтиПоРегулярномуВыражению(Строка, "^([а-яА-ЯЁё]+)((?:\-[а-яА-ЯЁё]+)?)$");
	Если РезПоиска.НачальнаяПозиция > 0 Тогда
		группыПоиска = РезПоиска.ПолучитьГруппы();
		Если ЗначениеЗаполнено(группыПоиска) И группыПоиска[0].НачальнаяПозиция > 0 И группыПоиска.Количество() >= 1 Тогда
			результат = группыПоиска[0].Значение;
			результат = ВРег(Лев(результат, 1)) + НРег(Сред(результат, 2));

			группыПоиска.Удалить(0);
			Для каждого стр Из группыПоиска Цикл
				Если стр.НачальнаяПозиция > 0 Тогда
					результат = результат + ВРег(Лев(стр.Значение, 2)) + НРег(Сред(стр.Значение, 3));
				КонецЕсли;
			КонецЦикла;

			Возврат результат;
		КонецЕсли;
	Иначе
		ВызватьИсключение("Ошибка. Неверный формат ввода.");
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция СоставитьФИО(Фамилия, Имя, Отчечество)
	Возврат СокрЛП(СтрШаблон("%1 %2 %3", Фамилия, Имя, Отчечество));
КонецФункции
