#Область ПрограммныйИнтерфейс

// Параметры:
//  номенклатураСсылка - СправочникСсылка.Номенклатура
//  поставщикСсылка - СправочникСсылка.Контрагенты
//  моментВремени - Дата, МоментВремени, Граница, Неопределено
// Возвращаемое значение:
//  - Число, Неопределено
Функция ПолучитьЦенуНоменклатуры(Знач номенклатураСсылка, Знач поставщикСсылка, Знач моментВремени = Неопределено) Экспорт
    параметрыОтбора = Новый Структура("Номенклатура, Поставщик", номенклатураСсылка, поставщикСсылка);
    результат = получитьДанныеРегистра("СрезПоследнихИнтервал",
        Новый ФиксированнаяСтруктура("Цена"), параметрыОтбора, Истина);
    Возврат ?(результат = Неопределено ИЛИ результат.Количество() = 0, Неопределено, 0);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  видЗапроса - Строка
//  структураПолей - Структура, ФиксированнаяСтруктура, Неопределено
//  параметры - Структура, ФиксированнаяСтруктура
//  выгрузить - Булево - Если Истина - результат будет возвращен в виде ТаблицаЗначений, по умолчанию: Истина
// Возвращаемое значение:
//  - ТаблицаЗначений, ВыборкаИзРезультатаЗапроса, Неопределено
Функция получитьДанныеРегистра(Знач видЗапроса, Знач структураПолей, Знач параметры, выгрузить = Неопределено)
    выгрузить = ?(выгрузить = Неопределено, Истина, выгрузить);

    запрос = Неопределено;
    Если видЗапроса = "СрезПоследних" Тогда
        запрос = сформироватьЗапросСрезПоследних(структураПолей, параметры);
    Иначе
        ДиагностикаКлиентСервер.Утверждение(Ложь,
            СтрШаблон("Указанный вид запроса: ""%1"" не поддерживается.", Строка(видЗапроса)));
    КонецЕсли;
    ДиагностикаКлиентСервер.Утверждение(запрос <> Неопределено,
        "Ошибка при формировании запроса на получение данных регистра.");

    результатЗапроса = запрос.Выполнить();

    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

#Область ЗапросыДанных
// Формирует запрос записей среза последних за указанный период времени из регистра ЦеныНоменклатурыПоставщиков
//
// Параметры:
//  структураПолей - Структура, ФиксированнаяСтруктура
//      * Период - Строка, Неопределено
//      * Регистратор - Строка, Неопределено
//      * Активность - Строка, Неопределено
//      * Сотрудник - Строка, Неопределено
//      * Поставщик - Строка, Неопределено
//      * Цена - Строка, Неопределено
//  параметры - Структура, ФиксированнаяСтруктура
//      * МоментВремени - Дата, МоментВремени, Граница, Неопределено
//      * Номенклатура - СправочникСсылка.Номенклатура, ФиксированныйМассив, Неопределено
//      * Поставщик - СправочникСсылка.Контрагенты, Неопределено
//      * ВыбратьРазрешенные - Булево
// Возвращаемое значение:
//  - Запрос
Функция сформироватьЗапросСрезПоследних(Знач структураПолей, Знач параметры)
    параметры = ?(параметры = Неопределено, Новый Структура("МоментВремени, ВыбратьРазрешенные", Неопределено, Ложь), параметры);

    #Область ДиагностикаАргументов
    выполнитьДиагностикуСтруктурыПолей(структураПолей);
    ДиагностикаКлиентСервер.Утверждение(
        ТипЗнч(параметры) = Тип("Структура") ИЛИ ТипЗнч(параметры) = Тип("ФиксированнаяСтруктура"),
            "Аргумент ""Параметры"" должен иметь тип ""[Фиксированная]Структура"".");
    #КонецОбласти // ДиагностикаАргументов

    обязательныеПоля = Новый ФиксированнаяСтруктура("Период");

    Если НЕ структураПолей.Свойство(обязательныеПоля.Период) Тогда
        структураПолей.Вставить(обязательныеПоля.Период, обязательныеПоля.Период);
    КонецЕсли;

    // Инициализация параметров отбора
    отборВыбратьРазрешенные = ?(параметры.Свойство("ВыбратьРазрешенные"), параметры.ВыбратьРазрешенные, Ложь);
    отборМоментВремени = ?(параметры.Свойство("МоментВремени"), параметры.МоментВремени, Неопределено);
    отборСотрудник = ?(параметры.Свойство("Сотрудник"), параметры.Сотрудник, Неопределено);
    отборГрафик = ?(параметры.Свойство("ГрафикРаботы"), параметры.ГрафикРаботы, Неопределено);

    запрос = Новый Запрос;
    запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   &ТекстЗапросаПолей
        |ИЗ
        |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&ПараметрыВТ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
        |";

    // Формирование параметров запроса ВТ
    параметрыВТ = "&МоментВремени, &Условие";

    Если отборМоментВремени = Неопределено Тогда
        параметрыВТ = СтрЗаменить(параметрыВТ, "&МоментВремени", "");
    Иначе
        запрос.УстановитьПараметр("МоментВремени", отборМоментВремени);
    КонецЕсли;

    // Формирование условий запроса ВТ
    строкаУсловий = Неопределено;
    опциональныеПараметры = Новый Массив;
    ключиПараметра = "Имя, ЭтоМассив";
    Если отборСотрудник <> Неопределено Тогда
        опциональныеПараметры.Добавить(Новый Структура(ключиПараметра, "Номенклатура",
                РаботаСКоллекциямиКлиентСервер.ЭтоМассив(отборСотрудник, Ложь)));
    КонецЕсли;
    Если отборГрафик <> Неопределено Тогда
        опциональныеПараметры.Добавить(Новый Структура(ключиПараметра, "Поставщик",
                РаботаСКоллекциямиКлиентСервер.ЭтоМассив(отборГрафик, Ложь)));
    КонецЕсли;
    строкаУсловий = получитьТекстУсловияПоОпциональнымПараметрам(опциональныеПараметры, строкаУсловий);

    // Формирование текста запроса
    текстЗапросаПолей = РаботаСРеквизитами.СформироватьТекстЗапросаПолейПоРеквизитам(
            структураПолей, "ЦеныНоменклатурыПоставщиковСрезПоследних");
    текстЗапросаПолей = ?(ПустаяСтрока(текстЗапросаПолей), "*", текстЗапросаПолей);

    Если НЕ отборВыбратьРазрешенные Тогда
        запрос.Текст = СтрЗаменить(запрос.Текст, "РАЗРЕШЕННЫЕ", "");
    КонецЕсли;

    параметрыВТ = СтрЗаменить(параметрыВТ, "&Условие", ?(строкаУсловий = Неопределено, "", строкаУсловий));

    запрос.Текст = СтрЗаменить(запрос.Текст, "&ПараметрыВТ", параметрыВТ);
    запрос.Текст = СтрЗаменить(запрос.Текст, "&ТекстЗапросаПолей", текстЗапросаПолей);

    Возврат запрос;
КонецФункции
#КонецОбласти // ЗапросыДанных

Функция получитьТекстУсловияПоОпциональнымПараметрам(Знач параметры, Знач строкаУсловий)
    Для Каждого элемент Из параметры Цикл
        Возврат СтрШаблон("%1 %2%3", строкаУсловий, ?(строкаУсловий <> Неопределено, "И ", ""),
            СтрШаблон("%1 %2 &%1", элемент.Имя, ?(элемент.ЭтоМассив, "В", "=")));
    КонецЦикла;
КонецФункции

Процедура выполнитьДиагностикуСтруктурыПолей(Знач структураПолей)
    ДиагностикаКлиентСервер.Утверждение(
        ТипЗнч(структураПолей) = Тип("Структура") ИЛИ ТипЗнч(структураПолей) = Тип("ФиксированнаяСтруктура"),
            "Аргумент ""СтруктураПолей"" должен иметь тип ""[Фиксированная]Структура"".");
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
