#Область ПрограммныйИнтерфейс

Функция ПолучитьЦенуПродажиНаДату(Номенклатура, Знач ВидЦены = Неопределено, Знач ДатаЦены = Неопределено) Экспорт
	запрос = Новый Запрос;
	запрос.Текст = "
		| ВЫБРАТЬ
		| 	ЦеныНоменклатуры.Цена КАК Цена
		| ИЗ
		| 	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|		&Период,
		|		Номенклатура = &Номенклатура
		|			И ВидЦены = &ВидЦены
		|	) КАК ЦеныНоменклатуры
		|";

	запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	запрос.УстановитьПараметр("Период", ДатаЦены);
	запрос.УстановитьПараметр("ВидЦены", ВидЦены);

	результатЗапроса = запрос.Выполнить();
	Если результатЗапроса.Пустой() Тогда
		Возврат NULL;
	КонецЕсли;

	Возврат результатЗапроса.Выбрать().Следующий().Цена;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
