#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(имяСобытия, параметрыСобытия, ___)
    Если имяСобытия <> "ЗаписьПрайсЛистаВДокумент" Тогда
        Возврат;
    КонецЕсли;

    загрузчик = Неопределено;
    параметрыСобытия.Свойство("Объект", загрузчик);

    ДиагностикаКлиентСервер.Утверждение(загрузчик <> Неопределено);

    Объект.Товары.Очистить();
    заполнитьТаблицуТоваровНаСервере(загрузчик.ПрайсЛист);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьПрайсЛист(_)
    имяФормыЗагрузчика = СтрШаблон("%1.%2", "Обработка.ЗагрузкаПрайсЛиста", "Форма");
    форма = ОткрытьФорму(
            имяФормыЗагрузчика, Новый Структура("ИмяДокументаОснования, Дата, Контрагент",
                "УстановкаЦенПоставщика", Объект.Дата, Объект.Контрагент),
            ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция заполнитьТаблицуТоваровНаСервере(Знач табДокПрайсЛиста)
    Возврат Документы.УстановкаЦенПоставщика.ЗаполнитьТаблицуТоваров(Объект.Товары, табДокПрайсЛиста);
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
