#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьПрайсЛист(_)
    имяФормыЗагрузчика = СтрШаблон("%1.%2", "Обработка.ЗагрузкаПрайсЛиста", "Форма");
    форма = ОткрытьФорму(
            имяФормыЗагрузчика, Новый Структура("ИмяДокументаОснования, Дата, Контрагент",
                "УстановкаЦенПоставщика", Объект.Дата, Объект.Контрагент),
            ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

&НаСервере
Процедура ЗагрузитьПрайсЛистНаСервере()
    загрузчик = Обработки.ЗагрузкаПрайсЛиста.Создать();
    //имяФормыЗагрузчика = СтрШаблон("%1.%2", загрузчик.Метаданные().ОсновнаяФорма, "Форма");
    форма = загрузчик.ПолучитьФорму(загрузчик.Метаданные().ОсновнаяФорма.ПолноеИмя());
    форма.Открыть();
    //форма = ОткрытьФорму(
    //	загрузчик.Метаданные().ОсновнаяФорма.ПолноеИмя(), , ЭтотОбъект, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
