#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(имяСобытия, параметрыСобытия, ___)
    Если имяСобытия <> "ЗаписьПрайсЛистаВДокумент" ИЛИ параметрыСобытия = Неопределено Тогда
        Возврат;
    КонецЕсли;

    создательФормы = Неопределено;
    параметрыСобытия.Свойство("СоздательФормы", создательФормы);
    Если создательФормы <> ЭтотОбъект.УникальныйИдентификатор Тогда
        Возврат;
    КонецЕсли;

    загрузчик = Неопределено;
    параметрыСобытия.Свойство("Объект", загрузчик);

    ДиагностикаКлиентСервер.Утверждение(загрузчик <> Неопределено);

    Объект.Товары.Очистить();
    заполнитьТаблицуТоваровНаСервере(загрузчик.ПрайсЛист);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьПрайсЛист(_)
    форма = ФормыКонфигурацииКлиент.ОткрытьФормуЗагрузкиПрайсЛиста(
            ЭтотОбъект, Новый Структура("СоздательФормы, Дата, Контрагент",
                ЭтотОбъект.УникальныйИдентификатор, Объект.Дата, Объект.Контрагент));
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция заполнитьТаблицуТоваровНаСервере(Знач табДокПрайсЛиста)
    Возврат Документы.УстановкаЦенПоставщика.ЗаполнитьТаблицуТоваров(Объект.Товары, табДокПрайсЛиста);
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
